import streamlit as st
import pandas as pd

def timetable():
    st.write("## 정적 시간표")
    data = [["-", "-", "-", "-", "-"],
    ["-", "-", "-", "-", "컴퓨팅 탐색"],
    ["-", "응용공학수학2", "-", "응용공학수학2", "컴퓨팅 탐색"],
    ["대학 글쓰기 1", "-", "대학 글쓰기 1", "-", "컴퓨팅 탐색"],

    ["대학 글쓰기 1", "테니스 초급", "대학 글쓰기 1", "재료역학 및 실험", "응용소프트웨어공학"],
    ["환경유체역학", "테니스 초급", "환경유체역학", "재료역학 및 실험", "응용소프트웨어공학"],
    ["-", "-", "-", "재료역학 및 실험", "응용소프트웨어공학"],
    ["-", "-", "-", "재료역학 및 실험", "응용소프트웨어공학"]]
    df = pd.DataFrame(data, index = range(1, 9, 1), columns = ['월', '화', '수', '목', '금'])
    st.write(df)

def showjson():
    st.write("## 수업 정보")
    json_data = {"대학 글쓰기 1": {"교수": "허윤", "강의실": "43-1-405"},
                 "환경유체역학": {"교수": "강문성", "강의실": "200-1024"},
                 "응용공학수학": {"교수": "김성배", "강의실": "200-1043"},
                 "테니스초급": {"교수": "김진국", "강의실": "테니스장"},
                 "재료역학 및 실험": {"교수": "최원", "강의실": "200-1024"},
                 "컴퓨팅 탐색": {"교수": "변해선", "강의실": "26-104"},
                 "응용소프트웨어공학": {"교수": "이승찬", "강의실": "200-1007"}}
    st.json(json_data)

def summary():
    st.write("## 이번 학기 요약")
    left, right = st.columns([2, 1])
    with left:
        st.metric(label="수강과목수", value="8")
    with right:
        st.metric(label="총학점", value="50", delta="18")


timetable()
showjson()
summary()